{"Groups":[{"Channels":["Hematoxylin","Eosin"],"Colors":["8233CC","FF8080"],"Name":"Histology","Path":"Histology_40__HE-r--41__HE-g--42__HE-b"},{"Channels":["DNA1","PanCK","ASMA","CD31","CD45"],"Colors":["0000ff","ffffff","ff0000","00ff00","ffff00"],"Name":"Tissue Structure","Path":"Tissue-Structure_0__DNA1--14__PanCK--15__ASMA--35__CD31--18__CD45"},{"Channels":["DNA1","CD45","CD8a","CD4","CD20","CD68","CD163"],"Colors":["0000ff","ffffff","ff0000","ff00ff","ffff00","00ff00","00ffff"],"Name":"Immune Populations","Path":"Immune-Populations_0__DNA1--18__CD45--23__CD8a--17__CD4--21__CD20--22__CD68--25__CD163"},{"Channels":["DNA1","CD8a","CD4","CD20","FOXP3"],"Colors":["0000ff","00ff00","ff0000","ffff00","ffffff"],"Name":"Lymphocytes","Path":"Lymphocytes_0__DNA1--23__CD8a--17__CD4--21__CD20--26__FOXP3"},{"Channels":["DNA1","CD68","CD163"],"Colors":["0000ff","00ff00","ff0000"],"Name":"Macrophages","Path":"Macrophages_0__DNA1--22__CD68--25__CD163"},{"Channels":["DNA1","PCNA","PanCK","CD45","Ki67"],"Colors":["0000ff","ff0000","ffffff","00ffff","00ff00"],"Name":"Proliferation","Path":"Proliferation_0__DNA1--37__PCNA--14__PanCK--18__CD45--13__Ki67"},{"Channels":["DNA1","PanCK","PDL1","PD1"],"Colors":["0000ff","ffffff","ff0000","00ff00"],"Name":"PD1 Immune Checkpoint","Path":"PD1-Immune-Checkpoint_0__DNA1--14__PanCK--27__PDL1--19__PD1"},{"Channels":["DNA1","CD4","FOXP3"],"Colors":["0000ff","ffffff","ff0000"],"Name":"Helper and Regulatory T Cells","Path":"Helper-and-Regulatory-T-Cells_0__DNA1--17__CD4--26__FOXP3"},{"Channels":["DNA1","CD8a","PD1"],"Colors":["0000ff","ffffff","00ff00"],"Name":"CD8 Cytotoxic T Cells","Path":"CD8-Cytotoxic-T-Cells_0__DNA1--23__CD8a--19__PD1"},{"Channels":["DNA1","CD8a","FOXP3"],"Colors":["0000ff","ffffff","ff0000"],"Name":"FOXP3 CD8 T Cells","Path":"FOXP3-CD8-T-Cells_0__DNA1--23__CD8a--26__FOXP3"},{"Channels":["DNA1","PanCK","Na_K_ATPase"],"Colors":["0000ff","ffffff","00ff00"],"Name":"NaK ATPase","Path":"NaK-ATPase_0__DNA1--14__PanCK--10__Na-K-ATPase"},{"Channels":["DNA1","PanCK","Ecadherin"],"Colors":["0000ff","ffffff","00ff00"],"Name":"E-Cadherin","Path":"E-Cadherin_0__DNA1--14__PanCK--29__Ecadherin"},{"Channels":["DNA1","ASMA","Desmin","Collagen","Vimentin"],"Colors":["0000ff","ff0000","00ff00","ffffff","00ffff"],"Name":"Stroma","Path":"Stroma_0__DNA1--15__ASMA--34__Desmin--39__Collagen--30__Vimentin"},{"Channels":["DNA1","CD4","CD68","CD163","PDL1"],"Colors":["0000ff","ffffff","00ffff","00ff00","ff0000"],"Name":"PDL1-Positive Immune Cells","Path":"PDL1-Positive-Immune-Cells_0__DNA1--17__CD4--22__CD68--25__CD163--27__PDL1"},{"Channels":["DNA1","PDL1","CD8a","PD1"],"Colors":["0000ff","ff0000","ffffff","00ff00"],"Name":"PDL1-CD8 Interaction","Path":"PDL1-CD8-Interaction_0__DNA1--27__PDL1--23__CD8a--19__PD1"},{"Channels":["DNA1","PanCK","Ecadherin","PCNA"],"Colors":["0000ff","ffffff","00ff00","ff0000"],"Name":"Tumor Budding Epithelial","Path":"Tumor-Budding-Epithelial_0__DNA1--14__PanCK--29__Ecadherin--37__PCNA"},{"Channels":["DNA1","PanCK","PDL1","FOXP3","CD8a","PD1","CD68"],"Colors":["0000ff","ffffff","ff0000","ffff00","00ff00","6c00ff","654321"],"Name":"Tumor Budding Immune Modulation","Path":"Tumor-Budding-Immune-Modulation_0__DNA1--14__PanCK--27__PDL1--26__FOXP3--23__CD8a--19__PD1--22__CD68"},{"Channels":["DNA1","LaminABC"],"Colors":["0000ff","00ff00"],"Name":"Nuclear Lamina","Path":"Nuclear-Lamina_0__DNA1--33__LaminABC"},{"Channels":["DNA1","DNA10"],"Colors":["0000ff","ff0000"],"Name":"DAPI Cycle Correlation","Path":"DAPI-Cycle-Correlation_0__DNA1--36__DNA10"},{"Channels":["DNA1","PanCK","Ecadherin","PCNA"],"Colors":["0000ff","ffffff","00ff00","ff0000"],"Name":"Transitions","Path":"Transitions_0__DNA1--14__PanCK--29__Ecadherin--37__PCNA"}],"Header":"This Minerva introduction accompanies the analysis in Lin et al 2021 of specimen CRC1, a poorly differentiated stage IIIB adenocarcinoma (pT3N1bM0) with microsatellite instability (MSI-H) and a BRAFV600E (c.1799T>A) mutation. The tumor along with adjacent normal tissue was imaged using 24-plex cyclic immunofluorescence at a nominal resolution of 0.5 micron.","Images":[{"Description":"CRC01-096 and CRC01-097","Height":27120,"MaxLevel":5,"Name":"i0","Path":"https://s3.amazonaws.com/www.cycif.org/lin-wang-coy-2021/reg_96_97","Width":26139},{"Name":"workaround-decouple-storyname-image-description"}],"Layout":{"Grid":[["i0"]]},"Masks":[],"Name":"Multiplexed 3D atlas of state transitions and immune interactions in colorectal cancer (Introduction)\n","Rotation":0,"Stories":[{"Description":"","Name":"","Waypoints":[{"ActiveMasks":[],"Arrows":[],"Description":"The tumor is derived from a 69-year old male with a history of cutaneous melanoma and gastric MALT lymphoma associated with helicobacter pylori infection. He presented to medical attention following several syncopal episodes and falls thought to be secondary to anemia and orthostatic hypotension. Colonoscopy revealed a mass in the right ascending colon. He underwent hemicolectomy revealing a 6.2cm exophytic mass involving the ascending colon, cecum, and terminal ileum. \n\nHe underwent right hemicolectomy and the specimen was examined by pathology. \n\nPATHOLOGIC DIAGNOSIS:\n\nINVASIVE ADENOCARCINOMA, high grade (poorly differentiated, grade III), with mucinous and signet ring cell features (6.2cm)\n\nThe tumor resection margins were negative for involvement by adenoma, dysplasia, and adenocarcinoma.\n \nLymphovascular invasion (LVI) was identified at the time of pathologic evaluation of the whole specimen, but is not identified in this tissue section. \n\nPerineural invasion (PNI) was not identified. \n\nNo tumor deposits were present.\n\nThe tumor was associated with a villous adenoma. \n\n3/25 local lymph nodes were positive for involvement by metastatic adenocarcinoma. \n\nMolecular testing was notable for the presence of a BRAF V600E mutation, and microsatellite instability (MSI-H). \n\nAJCC Classification (8th Ediiton) - pT3N1b\n","Group":"Histology","Masks":[],"Name":"Clinical History","Overlays":[],"Pan":[0.481913716814159,0.5],"Zoom":0.518359375},{"ActiveMasks":[],"Arrows":[{"Angle":300,"HideArrow":false,"Point":[0.807627524065269,0.306258334920546],"Text":"Mucosa"},{"Angle":300,"HideArrow":false,"Point":[0.765761996140962,0.261043564762295],"Text":"Muscularis Mucosa"},{"Angle":300,"HideArrow":false,"Point":[0.740642679386377,0.214154173487071],"Text":"Submucosa"},{"Angle":315,"HideArrow":false,"Point":[0.641002722926526,0.155542434393041],"Text":"Muscularis Propria"},{"Angle":325,"HideArrow":false,"Point":[0.519592691946036,0.0994426269744693],"Text":"Subserosa"},{"Angle":180,"HideArrow":false,"Point":[0.146989493419702,0.24680928526803],"Text":"Serosa"},{"Angle":180,"HideArrow":false,"Point":[0.0867031332087,0.567499229168223],"Text":"Invasive Adenocarcinoma, involving Muscularis Propria"},{"Angle":180,"HideArrow":false,"Point":[0.191366953019468,0.863069856313831],"Text":"Invasive Adenocarcinoma, involving Submucosa"},{"Angle":30,"HideArrow":false,"Point":[0.398182660965545,0.919169663732403],"Text":"Invasive Adenocarcinoma, Superficial/luminal Surface"},{"Angle":30,"HideArrow":false,"Point":[0.265050282166248,0.96103519165671],"Text":"Ulcer Bed"},{"Angle":230,"HideArrow":false,"Point":[0.409905008784351,0.640345247756517],"Text":"Invasive Adenocarcinoma, with Mucinous Features"},{"Angle":360,"HideArrow":false,"Point":[0.858684481416086,0.531246000270804],"Text":"Invasive Adenocarcinoma, with Solid Architecture"},{"Angle":360,"HideArrow":false,"Point":[0.743403329861254,0.370787100133673],"Text":"Invasive Adenocarcinoma, with Signet Ring Cell Features"},{"Angle":180,"HideArrow":false,"Point":[0.718867138820867,0.500478395632859],"Text":"Invasive Adenocarcinoma, Tumor Budding Region"},{"Angle":60,"HideArrow":true,"Point":[0.844385457582811,0.834212509419744],"Text":"Bowel Lumen"},{"Angle":86,"HideArrow":true,"Point":[0.0869986737335296,0.0954022705774824],"Text":"Peritoneal Cavity"}],"Description":"The colorectum is typically conceptually organized into anatomic layers, which are described proceeding from the luminal surface to the serosal surface. \n\nMucosa - The mucosa occupies the luminal surface of the colorectum and accomplishes the primary functions of the bowel including nutrient absorption, facilitation of waste excretion, and regulation of the enteral microbiome. Histologically, the mucosa consists of a surface columnar epithelium bounded by basement membrane and underlying stroma which is densely populated by chronic inflammatory cells including lymphocytes, monocytic cells, and eosinophils with only rare neutrophils in the resting state (see immune populations marker set). The epithelium exhibits regular invaginations into the stroma with a circumferential parallel array of tubular epithelial \"crypts\" which are arrayed similar to a rack of test tubes, with openings into the bowl lumen. In this section, crypts can be seen in cross-section and in longitudinal profile. The epithelium consists of a mixture of cell types, including prominent mucinous goblet cells which exhibit a clear cytoplasm in standard H&E sections (resulting from a washing out of the mucinous contents during tissue processing), absorptive cells which exhibit a more eosinophilic cytoplasm, and more rarely interspersed neuroendocrine cells. The mucinous goblet cells are more prominent in the colorectum than in the small bowel. The deep aspect of the crypts is hypothesized to harbor stem-like progenitor cells which intermittently generate highly proliferative progenitor cells that terminal differentiate as they approach the luminal surface to continuously regenerate and replace the colorectal epithelial surface. Indeed, examination of the crypts with proliferation markers such as PCNA or Ki-67 shows a much higher degree of cell cycle activity in the deep aspects of the crypts (see proliferation marker set). \n\nMuscularis mucosa - The muscularis mucosa is a thin band of smooth muscle cells which delimits the deep edge of the mucosal compartment. The muscularis mucosa can be identified in this section as a brightly eosinophilic band of spindled cells at the deep surface of the mucosa on H&E. In tumor resections, invasion of atypical cells through the muscularis mucosa into the submucosa represents an important event, as this behavior is the definitive finding defining transition from an \"in situ\" carcinoma with essentially no metastatic risk (pTis), to an \"invasive\" carcinoma with associated increased risk of local or distant metastatic spread (pT1) [AJCC 8th Edition]. The muscularis mucosa can be highlighted here by observing the aSMA, desmin, or collagen channels in the Tissue Structure or Stroma marker sets, respectively. \n\nSubmucosa - The submucosa is a loose collagenous connective tissue structure interposed between the muscularis mucosa and muscularis propria. The submucosa contains a rich bed of lymphatic and blood vessels, and lymphovascular invasion (LVI) is often identified at this level if present. Involvement of the submucosa by tumor defines frank invasion in the colorectum (pT1). \n\nMuscularis propria - The muscularis propria is the thick smooth muscular wall of the bowel which is arranged into several distinct layer, principally including the longitudinal and circumferential layers in the colorectum (these can be seen here as the two distinct layers of smooth muscle oriented in different directions on H&E).  The muscularis regulates digestion by controlling peristalsis and moevement of the bowel wall. Invasion of an invasive adenocarcinoma into the muscularis propria represents a more advanced stage of invasion (pT2) with a higher risk of recurrence and metastatic spread (pT2). The muscularis mucosa can be highlighted here by observing the aSMA, desmin, or collagen channels in the Tissue Structure or Stroma marker sets, respectively. \n\nSubserosa - The subserosa is the loose fibroadipose connective tissue associated with the bowl wall which lies deep to the muscularis propria. Invasion of tumor into the subserosal soft tissue denotes a further progression of stage with increased risk of recurrence and metastatis (pT3). \n\nSerosa - The serosa is the final layer of the bowel wall. In the peritoneal cavity it is lined by a single layer of cuboidal mesothelial cells. Mesothelial cells are specialized epithelial cells and may sometimes cause confusion with invasive tumor when they undergo hyperplasia and reactive changes and exhibit clusters of cells with frond-like papillary architecture; however, they may be differentiated from other epithelial tumor cells by molecular markers including the absence of e-cadherin expression, and expression of mesothelial cell markers such as WT1 and calretinin (see Tissue Structure and E-Cadherin marker sets). In the retroperitoneum (some aspects of the right colon including the cecum), the serosal surface is bounded by a fibrous adventitial layer. Invasion of tumor through the serosal surface into the peritoneal cavity or adjacent structures represents the highest grade of local invasion, with the greatest risk of recurrence and metastatic spread (pT4). This section of bowel exhibits some hyperplasia of the mesothelial cell layer, giving it a more complex tufted appearance, but these cells may be confirmed as mesothelial and not surface involvement by morphologic features and marker expression (see E-cadherin marker set).\n\nIn this case, the tumor is present on the bottom aspect of the frame, while the serosal surface is present at the superior aspect. The bowel wall has been cut in an oblique plane, accounting for the convoluted appearance of the muscularis and serosa. \n\nThe tumor exhibits an exophytic (extending into the bowel lumen) growth pattern on the right-hand side of the field, with prominent mucinous pools generated by mucinous tumor cells present inferiorly extending as deeply as the muscularia propria. The tumor exhibits a moderately differentiated glandular appearance on the left-hand and bottom aspects of the field, while on the right side of the field in the exophytic region of tumor there are intermixed regions with a more poorly differentiated solid sheet-like architecture, with focal signet ring cell features and tumor budding. \n\nCollections of immune cells are present associated with the tumor, in addition to the normal immune complement of the bowel mucosa (see immune marker panels, and subsequent discussion).","Group":"Histology","Masks":[],"Name":"Tissue Organization [Histology]","Overlays":[],"Pan":[0.481913716814159,0.5],"Zoom":0.518359375},{"ActiveMasks":[],"Arrows":[{"Angle":300,"HideArrow":false,"Point":[0.815749436482584,0.316503391107762],"Text":"Mucosa"},{"Angle":300,"HideArrow":false,"Point":[0.787866994884996,0.269027882441597],"Text":"Muscularis Mucosa"},{"Angle":300,"HideArrow":false,"Point":[0.745666542737294,0.204973624717408],"Text":"Submucosa"},{"Angle":300,"HideArrow":false,"Point":[0.641672571373315,0.154483798040693],"Text":"Muscularis Propria"},{"Angle":300,"HideArrow":false,"Point":[0.524616555296952,0.0864941806916185],"Text":"Subserosa"},{"Angle":180,"HideArrow":false,"Point":[0.132755213925438,0.260654776856736],"Text":"Serosa"},{"Angle":180,"HideArrow":false,"Point":[0.0850285120917276,0.553713472326886],"Text":"Invasive Adenocarcinoma, involving Muscularis Propria"},{"Angle":180,"HideArrow":false,"Point":[0.191366953019468,0.86770493175919],"Text":"Invasive Adenocarcinoma, involving Submucosa"},{"Angle":30,"HideArrow":false,"Point":[0.418278114369212,0.909570459683497],"Text":"Invasive Adenocarcinoma, superficial/luminal surface"},{"Angle":30,"HideArrow":false,"Point":[0.276772629985054,0.975717993803902],"Text":"Ulcer Bed"},{"Angle":220,"HideArrow":false,"Point":[0.397345350407059,0.645817633760362],"Text":"Invasive Adenocarcinoma, with Mucinous Features"},{"Angle":360,"HideArrow":false,"Point":[0.753202337763669,0.378715565603282],"Text":"Invasive Adenocarcinoma, with Signet Ring Cell Features"},{"Angle":360,"HideArrow":false,"Point":[0.856443289976337,0.533737010323139],"Text":"Invasive Adenocarcinoma, with Solid Architecture"},{"Angle":180,"HideArrow":false,"Point":[0.718707533645425,0.504093567653586],"Text":"Invasive Adenocarcinoma, Tumor Budding Region"},{"Angle":60,"HideArrow":true,"Point":[0.844469188638659,0.910240308130285],"Text":"Bowel Lumen"},{"Angle":60,"HideArrow":true,"Point":[0.0891690798501797,0.100174053827581],"Text":"Peritoneal Cavity"}],"Description":"Multiplexed immunofluorescence (CyCIF) effectively highlights the principle anatomic compartments of the tissue specimen. \n\nStroma  - Alpha smooth muscle actin (ASMA) [Red] - ASMA highlights smooth muscle cells and myofibroblasts. The muscularis propria is comprised of thick bundles of smooth muscle cells which stain intensely for ASMA in the center of the specimen. The muscularis mucosa is identifiable as a prominent band of ASMA-positive smooth muscle cells bounding the mucosal compartment on the upper right of the specimen. The smooth muscle layer (tunica media) of large veins and arteries and arterioles are also highlighted by ASMA, most prominently seen here in the submucosa and subserosa. Myofibroblasts are visible as spindled cells with less intense ASMA staining, most prominently in the stroma of the mucosa, submucosa, and subserosa. Note that not all stromal fibroblastic cells express ASMA. Smooth muscle cells are also prominently stained by desmin and vimentin, and associated with collagen bundles (see also Stroma marker set). \n\nEpithelial - Pan-Cytokeratin (PanCK) [White] - Pan-cytokeratin highlights both high and low molecular weight cytokeratin intermediate filaments which are specifically expressed by cells with epithelial differentiation in this tissue setting. Accordingly, PanCK intensely highlights normal mucosal epithelium, tumor epithelial cells, and mesothelial cells. Normal epithelium and tumor cells also express other epithelial adhesion molecules such as e-cadherin, but this protein is not present in serosal mesothelial cells (see also E-cadherin, NaK ATPase marker sets)\n\nVascular  - CD31 [Green] - CD31 (PECAM-1) is a cell adhesion molecule that is most strongly expressed on endothelial cells, though it may also be expressed by platelets, monocytes, neutrophils, and T cells. In this representation, the fluorescence intensity has been optimized to highlight endothelial cells, which line the luminal surface of all vascular structures. \n\nImmune - CD45 [Yellow] - CD45 (PTPRC) encodes a surface membrane protein tyrosine phosphatase that is expressed by nearly all hematolymphoid cell populations, and therefore represents an excellent \"pan-immune\" tissue marker. Prominent aggregates of immune cells are present both in the peritumoral compartment as well as normal structures. A variety of marker sets are available to identify specific cell populations. \n\n","Group":"Tissue Structure","Masks":[],"Name":"Tissue Organization [CyCIF]","Overlays":[],"Pan":[0.481913716814159,0.5],"Zoom":0.518359375},{"ActiveMasks":[],"Arrows":[{"Angle":60,"HideArrow":true,"Point":[0.106934423989135,0.673880651886504],"Text":"ROI4"},{"Angle":60,"HideArrow":true,"Point":[0.240904113346918,0.847622592772379],"Text":"ROI3"},{"Angle":60,"HideArrow":true,"Point":[0.382549149490824,0.89227915589164],"Text":"ROI2"},{"Angle":60,"HideArrow":true,"Point":[0.725148719671404,0.287322277385402],"Text":"ROI1"},{"Angle":60,"HideArrow":true,"Point":[0.855174256062348,0.528461032283529],"Text":"ROI5"},{"Angle":60,"HideArrow":true,"Point":[0.440007770812969,0.686038227665296],"Text":"ROI6"},{"Angle":60,"HideArrow":true,"Point":[0.733066466283119,0.517994650302452],"Text":"ROI7"}],"Description":"Contemporary pathologic classification of human colorectal adenocarcinomas is principally based on the light microscopic examination of hematoxylin and eosin (H&E) stained tissue sections (Fletcher 2013). The TNM staging system developed by the American Joint Commission on Cancer (AJCC) is the most widely accepted classification schema with high prognostic significance (Amin et al. 2017). Staging of the primary tumor mass is primarily based on the depth of invasion of tumor into the bowel wall (AJCC 8th Edition):\n\nT0 - No evidence of primary tumor\n\nTis - Carcinoma in situ\n\nT1 - Tumor invades submucosa\n\nT2 - Tumor invades muscularis propria\n\nT3 - Tumor invades through the muscularis propria into the pericolorectal tissue\n\nT4 - Tumor invades the visceral peritoneum or invades or adheres to adhacent organs or structures\n\nPrimary tumors may also be independently classified by a variety of morphologic features including grade (low grade vs. high grade), qualitative degree of differentiation (well, moderately, poorly differentiated), type of differentiation (e.g. serous, mucinous, signet ring cell, sarcomatoid), architecture features (glandular, solid, cribriform, budding architecture), \n\nOn histopathologic review this tumor exhibited highly heterogeneous morphologic features with distinct locoregional relationships between tumor region and differentiation. \n\nWe accordingly defined exemplar regions of interest (ROI) to compare tumor compartments with distinctive morphologies as well as different levels of anatomic invasion corresponding to clinicopathologic (AJCC) tumor stages. \n\nROI1 - Normal colonic mucosa\n\nROI2 - Invasive Adenocarvinoma, superficial/luminal\n\nROI3  - Invasive Adenocarcinoma, submucosal\n\nROI4  - Invasive Adenocarcinoma, muscularis\n\nROI5 - Invasive Adenocarcinoma, solid/poorly differentiated\n\nROI6 - Invasive Adenocarcinoma, mucinous\n\nROI7 - Invasive Adenocarcinoma, tumor budding","Group":"Histology","Masks":[],"Name":"Regions of Interest - Overview","Overlays":[],"Pan":[0.481913716814159,0.5],"Zoom":0.518359375},{"ActiveMasks":[],"Arrows":[{"Angle":210,"HideArrow":false,"Point":[0.616983210209847,0.310703307581856],"Text":"Germinal center"},{"Angle":310,"HideArrow":false,"Point":[0.804453730438995,0.282016995085495],"Text":"Colonic crypts in longitudinal profile"},{"Angle":180,"HideArrow":false,"Point":[0.577318704807988,0.402104124377444],"Text":"Colonic crypts in cross-section"},{"Angle":60,"HideArrow":false,"Point":[0.707290413919064,0.310619183498289],"Text":"Mucosal stroma, with prominent immune infiltrate"},{"Angle":310,"HideArrow":false,"Point":[0.757344243641453,0.256359149597548],"Text":"Muscularis mucosa"},{"Angle":60,"HideArrow":true,"Point":[0.79435884041095,0.362355494892018],"Text":"Bowel Lumen"},{"Angle":60,"HideArrow":true,"Point":[0.737364773794281,0.430916622999155],"Text":"Adenocarcinoma, poorly differentiated region"},{"Angle":60,"HideArrow":true,"Point":[0.710865687470663,0.233645647034448],"Text":"Submucosa"},{"Angle":60,"HideArrow":true,"Point":[0.451132579457429,0.395163887483164],"Text":"Muscularis Propria"}],"Description":"Region of Interest #1 (ROI1) consists of a region of normal colonic mucosa adjacent to the primary tumor mass. No cytologic atypia or adenomatous changes are evident.\n\nOne may appreciate the typical mucosal architecture including parallel test tube-like crypts see here in cross-section and longitudinal profile. The colonic epithelium is well-ordered with columnar absorptive cells and prominent mucinous goblet cells, small basal nuclei, and well-spaced glands with smooth contours. A normal mucosal germinal center responsible for B cell maturation and plasma cell differentiation is present in the top left of the field. The surface of the colorectum is normally a relatively flat surface, but the mucosa is curved and distorted here by the adjacent exophytic tumor mass. One may note the dense lymphocytic infiltrate in the mucosal stromal, which is a normal finding. ","Group":"Histology","Masks":[],"Name":"*ROI1 - Normal Mucosa","Overlays":[{"height":0.0878255432439893,"width":0.246567688934993,"x":0.574515254951026,"y":0.252882790684345},{"height":0.160004006944509,"width":0.0782353977173467,"x":0.558363430906155,"y":0.326070743387669}],"Pan":[0.693199629921585,0.35257607017735],"Zoom":1.85737536},{"ActiveMasks":[],"Arrows":[{"Angle":60,"HideArrow":true,"Point":[0.404474190111976,0.941309789228942],"Text":"Bowel Lumen"},{"Angle":180,"HideArrow":false,"Point":[0.317331765583619,0.916968329863479],"Text":"Adenocarcinoma, with glandular architecture"},{"Angle":180,"HideArrow":false,"Point":[0.348732248165066,0.933763936825648],"Text":"Peritumoral stroma"},{"Angle":360,"HideArrow":false,"Point":[0.374534195092457,0.890436139155124],"Text":"Glandular lumen with mucin"},{"Angle":360,"HideArrow":false,"Point":[0.440621257269689,0.884229067016931],"Text":"Adenocarcinoma with cribriform architecture"}],"Description":"Region of Interest #2 (ROI2) consists of a region of invasive adenocarcinoma with a predominantly moderately differentiated glandular appearance and typical cytologic features. ROI2 is defined at the most superifical/luminal region of the tumor, though like ROI3 the tumor in this region predominantly involves the submucosal compartment (pT1 anatomic level). One may appreciate a prominent ulcer bed adjacent to this region, often present in the center of the superficial aspect of the tumor mass in colorectal adenocarcinomas. \n\nCompared to normal colonic mucosa, the adenocarcinomatous epithelium has a disordered arrangement of epithelial glandular structures which exhibit jagged erratic shapes. Cytologically, the tumor cells have an eosinophilic to amphophilic cytoplasm without prominent mucin vacuoles, with cuboidal to pseudo-stratified columnar arrangement. Glands are densely arranged with back to back glandular structures with minimal intervening stroma and focal regions of more disordered cribriform growth (multiple small lumens in a single glandular structure). The tumor cell nuclei are larger and more irregular than those of the normal mucosa, with darker hematoxylin staining of chromatin. \n\nThough less prominent than other tumor regions (ROI6), scattered mucinous cells and intraluminal mucin are present focally. The peritumoral stromal has a prominent lymphocytic inflammatory infiltrate in this region. \n\n[Regions of interest 2-3 (ROI2-4) each exhibit relatively similar morphologic and architectural features, and were selected to compare the molecular and spatial relationships of tumor and tumor-associated cells at different anatomic levels of invasion corresponding to defined AJCC staging criteria.]","Group":"Histology","Masks":[],"Name":"*ROI2 - Adenocarcinoma, Superficial","Overlays":[{"height":0.117082419547876,"width":0.147630951051532,"x":0.305891279681852,"y":0.835424440989178}],"Pan":[0.380619559933823,0.900233576549723],"Zoom":3.20954462208},{"ActiveMasks":[],"Arrows":[{"Angle":360,"HideArrow":false,"Point":[0.249824340684316,0.867594646418917],"Text":"Glandular lumen with mucin"},{"Angle":180,"HideArrow":false,"Point":[0.192419065680766,0.881590985554058],"Text":"Adenocarcinoma, with glandular architecture"},{"Angle":310,"HideArrow":false,"Point":[0.245767430790072,0.844977373758508],"Text":"Peritumoral stroma"},{"Angle":60,"HideArrow":true,"Point":[0.332382457032177,0.918914556581101],"Text":"ROI1"},{"Angle":60,"HideArrow":true,"Point":[0.270514581144959,0.938590569568184],"Text":"Ulcer Bed"}],"Description":"Region of Interest #3 (ROI3) consists of a region of invasive adenocarcinoma with a predominantly moderately differentiated glandular appearance and typical cytologic features. ROI3 is a well-defined region of invasive adenocarcinoma involving the submucosal compartment (pT1 anatomic level). \n\nCompared to ROI2,  the carcinomatous glands exhibit a more prominent pseudo-stratified columnar cytomorphology with disorganized and crowded back-to-back glandular structures. Regions of cribriform growth are not identified in this region, suggesting that this region of tumor is possibly somewhat more well-differentiated than the superificial tumor in ROI2. The peritumoral stroma is less prominent in this region, and significantly fewer peritumoral immune cells are present. While the tumor in this region exhibits a predominantly typical morphology, some scattered mucinous cells and intraluminal mucin are present.\n\n[Regions of interest 2-3 (ROI2-4) each exhibit relatively similar morphologic and architectural features, and were selected to compare the molecular and spatial relationships of tumor and tumor-associated cells at different anatomic levels of invasion corresponding to defined AJCC staging criteria.]\n","Group":"Histology","Masks":[],"Name":"*ROI3 - Adenocarcinoma, Submucosa","Overlays":[{"height":0.0829638073372858,"width":0.105378234502983,"x":0.179639799513898,"y":0.837877781443581}],"Pan":[0.231668399598117,0.883446929780717],"Zoom":3.851453546496},{"ActiveMasks":[],"Arrows":[{"Angle":180,"HideArrow":false,"Point":[0.0789774677122247,0.590523439970914],"Text":"Adenocarcinoma, with glandular architecture"},{"Angle":180,"HideArrow":false,"Point":[0.0924723727844373,0.608224549221478],"Text":"Glandular lumen with mucin"},{"Angle":360,"HideArrow":false,"Point":[0.143297339939524,0.610152392803223],"Text":"Extracellular mucin pool"},{"Angle":360,"HideArrow":false,"Point":[0.172565510680556,0.631884447724708],"Text":"Peritumoral lymphohistiocytic inflammation"},{"Angle":360,"HideArrow":false,"Point":[0.104214692782337,0.523048914609851],"Text":"Deepest invasive front of tumor"},{"Angle":60,"HideArrow":true,"Point":[0.243194689175383,0.609276100266066],"Text":"Muscularis Propria"}],"Description":"Region of Interest #4 (ROI4) consists of a region of invasive adenocarcinoma with a predominantly moderately differentiated glandular appearance and typical cytologic features. ROI4 is a well-defined region of invasive adenocarcinoma involving the muscularis propria, making it a higher stage of invasion than ROI2-3 (pT2 anatomic level). ROI4 also represents the deepest extent of invasion in this tissue section at its superior aspect in this field. \n\nWhile the adenocarcinomatous glands in this region maintain a glandular architecture with predominantly typical cytomorphology and columnar architecture, the glands exhibit somewhat more prominent intraluminal and extracellular mucin, though not to the extent of the mucinous region in ROI6. The tumor region exhibits relatively small amounts of peritumoral stroma and intratumoral immune infiltration, though the deep edges of the mass exhibit collections of lymphohistiocytic inflammation, most prominently around regions of extracellular mucin. \n\n[Regions of interest 2-3 (ROI2-4) each exhibit relatively similar morphologic and architectural features, and were selected to compare the molecular and spatial relationships of tumor and tumor-associated cells at different anatomic levels of invasion corresponding to defined AJCC staging criteria.]\n","Group":"Histology","Masks":[],"Name":"*ROI4 - Adenocarcinoma, Muscularis","Overlays":[{"height":0.218196841752009,"width":0.105155104458799,"x":0.0639052360731302,"y":0.514461247745715}],"Pan":[0.109998223527571,0.624786478173739],"Zoom":2.228850432},{"ActiveMasks":[],"Arrows":[{"Angle":60,"HideArrow":true,"Point":[0.90190277447454,0.525471465466552],"Text":"Bowel Lumen"},{"Angle":60,"HideArrow":true,"Point":[0.856239060676483,0.495185506186607],"Text":"Colonic Mucosa"},{"Angle":60,"HideArrow":false,"Point":[0.860465008482987,0.532514711810725],"Text":"Adenocarcinoma, with solid architecture"},{"Angle":180,"HideArrow":false,"Point":[0.856591222993692,0.532045162054447],"Text":"Intracellular mucin vacuole"},{"Angle":360,"HideArrow":false,"Point":[0.888579300140146,0.504165645275428],"Text":"Discohesive and fragmented adenocarcinoma, with focal signet ring cell features"}],"Description":"Region of Interest #5 (ROI5) consists of a region of adenocarcinoma with near-complete loss of glandular morphology and a solid sheet-like architecture, suggestive of a more poorly differentiated state. \n\nHowever, scattered tumor cells still exhibit intracellular mucin vacuoles, exposing the underlying cytomorphologic differentiation despite the loss of glandular architecture. At the top-right region of the field some cells have become increasingly discohesive with more prominent mucin vacuoles, with focal signet ring cell morphology (cells with a promeint cytoplasmic mucin vacuole and nucleus 'pushed' to the periphery of the cell).\n\nThis region of tumor is present in both the mucosa and submucosa, notice the mucosal glands and stroma adjacent to the solid tumor to the left, and a region of more glandular architecture inferiorly. ","Group":"Histology","Masks":[],"Name":"*ROI5 - Adenocarcinoma, Solid","Overlays":[{"height":0.0591632692910555,"width":0.0579893949003599,"x":0.840156981523954,"y":0.485207573865695}],"Pan":[0.872849383304825,0.516461979517963],"Zoom":6.65531172834508},{"ActiveMasks":[],"Arrows":[{"Angle":60,"HideArrow":true,"Point":[0.413938390261963,0.609300898756441],"Text":"Muscularis propria"},{"Angle":60,"HideArrow":true,"Point":[0.448311490807455,0.740887790272005],"Text":"Submucosa"},{"Angle":310,"HideArrow":false,"Point":[0.466305059467286,0.632746047346773],"Text":"Peritumoral inflammation"},{"Angle":200,"HideArrow":false,"Point":[0.41532586482566,0.637036375608692],"Text":"Invasive Front"},{"Angle":310,"HideArrow":false,"Point":[0.43576801713245,0.665428253812568],"Text":"Extracellular mucin"},{"Angle":310,"HideArrow":false,"Point":[0.484980606019168,0.666059184439321],"Text":"Adenocarcinoma, with cribriform architecture"},{"Angle":180,"HideArrow":false,"Point":[0.39740743502588,0.690917851133381],"Text":"Carcinomatous glandular lumen in cribfriform structure"}],"Description":"Region of interest #6 (ROI) comprises a region of \"floating\" tumor with prominent extracellular mucin surrounding the tumor epithelium. \n\nIn this tumor, prominent mucinous regions are present at the deep invasive front broadly across the tumor. The tumor in this region exhibits a prominent cribriform architecture with multiple small lumens within a sheet-like structure of tumor epithelium with no intervening stroma. Minimal peritumoral stromal is present immediately adjacent to the tumor epithelium. There is minimal inflammatory cell infiltration into the mucin pools and tumor epithelium, though prominent lymphohistiocytic inflammation is present surrounding the extracellular mucin pools. \n\nMacrophage populations are particularly prominent in this region (see Macrophage marker set), likely at least in part resulting from a phagocytic response of macrophages to extracellular mucinous material. ","Group":"Histology","Masks":[],"Name":"*ROI6 - Adenocarcinoma, Mucinous","Overlays":[{"height":0.0917625503549266,"width":0.155360357531609,"x":0.371994122195437,"y":0.637465641934686}],"Pan":[0.450078708897922,0.675930909892408],"Zoom":3.0956256},{"ActiveMasks":[],"Arrows":[{"Angle":60,"HideArrow":true,"Point":[0.835703507969231,0.50829264236419],"Text":"Mucosa"},{"Angle":60,"HideArrow":true,"Point":[0.634815196411141,0.55119592498338],"Text":"Submucosa"},{"Angle":60,"HideArrow":false,"Point":[0.746363731221035,0.539208243075077],"Text":"Prominent peritumoral lymphohistiocytic inflammation"},{"Angle":180,"HideArrow":false,"Point":[0.706993660111661,0.521289813275298],"Text":"Adenocaricnoma, with glandular archiecture"},{"Angle":310,"HideArrow":false,"Point":[0.735125833258095,0.515075052064657],"Text":"Tumor Budding Cell(s)"},{"Angle":310,"HideArrow":false,"Point":[0.723797945387883,0.502279821206076],"Text":"Tumor Budding Cell(s)"},{"Angle":310,"HideArrow":false,"Point":[0.714935193738131,0.492419276324233],"Text":"Tumor Budding Cell(s)"}],"Description":"Region of Interest #7 (ROI) comprises a region of tumor with clusters of tumor budding cells extending into the peritumoral stroma. \n\nTumor budding is defined as clusters of <=4 tumor cells, typically located at the invasive front of the tumor. A prominent peritumoral lymphohistiocytic inflammatory proliferation is present adjacent to the region of tumor budding. \n\nTumor budding cells may be difficult to appreciate on standard H&E sections, but are highlighted by PanCK (see also, Tumor Budding marker sets, and subsequent discussion).  ","Group":"Histology","Masks":[],"Name":"*ROI7 - Tumor Budding Cells","Overlays":[{"height":0.0586765482880101,"width":0.0714213469484165,"x":0.687560996807675,"y":0.489490909686957}],"Pan":[0.724133718522389,0.521758434263343],"Zoom":3.851453546496},{"ActiveMasks":[],"Arrows":[{"Angle":310,"HideArrow":false,"Point":[0.727080493256782,0.502476977421495],"Text":"Tumor Budding Cell(s)"},{"Angle":310,"HideArrow":false,"Point":[0.734417208198629,0.513677695566049],"Text":"Tumor Budding Cell(s)"},{"Angle":310,"HideArrow":false,"Point":[0.753394844181541,0.522824133526885],"Text":"Tumor Budding Cell(s)"},{"Angle":310,"HideArrow":false,"Point":[0.754666541438128,0.502183508823822],"Text":"Tumor Budding Cell(s)"},{"Angle":30,"HideArrow":false,"Point":[0.740266172148522,0.527883887596454],"Text":"Poorly Differentiated Cluster"},{"Angle":330,"HideArrow":false,"Point":[0.713184751391609,0.493707334464114],"Text":"Poorly Differentiated Cluster"},{"Angle":60,"HideArrow":true,"Point":[0.703841161573265,0.520988618104842],"Text":"Main Tumor Mass"},{"Angle":60,"HideArrow":true,"Point":[0.734270285634077,0.491758671346919],"Text":"Main Tumor Mass"},{"Angle":30,"HideArrow":false,"Point":[0.726825393211973,0.526984504619287],"Text":"Poorly Differentiated Cluster"},{"Angle":60,"HideArrow":true,"Point":[0.682455833005075,0.54007552350916],"Text":"Submucosa"}],"Description":"Tumor budding is a phenomenon in which single tumor cells or small clusters of <=4 cells are present in the peri-tumoral stroma, most characteristically at the deep invasive front of a tumor, resulting in an appearance of cells sprouting or budding from the tumor mass [1]. Tumor budding was first conceptually described in 1949 by Imai et al. in their classification of gastric carcinomas [2], and subsequently shown to correlate with clinical outcome in a variety of solid cancers including for colorectal carcinomas, though the concept was only minimally explored until the 1980s [3]. Since that period, a number of studies have explored the possibility of using tumor budding as a novel tumor classifier, and systematic meta-analyses show that tumor budding significantly correlates with poor outcomes in colorectal carcinomas including risk of lymph node metastases, local recurrence, distant metastases, and cancer-related death, independently of tumor TNM stage [4]. The related concept of poorly differentiated clusters (PDCs) refers to similar collections of cells at the invasive front that have lost glandular differentiation, but which form larger clusters and do not meet the definition of tumor budding (>=5 cells) [5]. \n\nPathologic examination of the CRC01 tissue specimen revealed a region of prominent tumor budding near the invasive front of the tumor. Tumor budding cells were annotated by a pathologists using the ITBCC consensus criteria of <=4 cells and were segmented and analyzed for marker expression and neighborhood spatial correlations at a single cell level. Scattered poorly differentiated clusters were also present in the region of tumor budding, and were noted but not included in the training cohort of tumor budding cells. \n\nSingle cell analysis of marker expression in tumor budding cells relative to other tumor cell populations in the main mass (ROI2-6) and normal mucosa (ROI1) showed that these cells exhibit a unique molecular phenotype characterized by reduced expression of characteristic epithelial markers such as E-cadherin and NaK ATPase and reduced proliferative cell cycle activity as assessed by PCNA and Ki-67/MIB-1 staining (highlighted in this field). On the other hand, tumor budding cells at the invasive tumor margin exhibited higher expression of PD-L1 compared to the main tumor mass, indicating that they may suppress local anti-tumor cytotoxic immunity. \n\nInterestingly, these markers exhibited a continuous graded expression profile correlating with tumor cluster size with tumor budding cells representing just one end of a continuous spectrum of molecular differentiation. Larger clusters, including those that would be classified as poorly differentiated clusters (PDCs) also exhibited reduced expression of these markers relative to the main tumor mass, though at an intermediate level to tumor budding cells and the main mass. \n\n3D reconstruction and analysis of tumor budding regions showed that tumor buds in fact rarely represent individual cells or clusters which have completely separated from the main tumor mass, but rather, represent the tips of a contiguous complex network of tendril-like structures connected to the main tumor mass. Poorly differentiated clusters in the region of tumor budding rather than representing distinct tumor nests, instead represent the more proximal aspects of this network. These findings suggest that while tumor budding cells exhibit a migratory molecular program, they have not undergone definitive epithelial-to-mesenchymal differentiation and remain an intrinsic yet specialized epithelial niche of the overall tumor mass. \n\nHere, we highlight tumor budding cells and poorly differentiated clusters (arrows) at the invasive front of the tumor. Tumor budding cells exhibit significantly reduced expression of E-cadherin (green) and PCNA (red) compared to adjacent PDCs or the main tumor mass, while many PDCs exhibit an intermediate expression pattern, though this is more difficult to appreciate qualitatively. \n\n[1] Lugli, A. et al. Recommendations for reporting tumor budding in colorectal cancer based on the International Tumor Budding Consensus Conference (ITBCC) 2016. Mod. Pathol. 30, 1299–1311.\n\n[2] Imai T. Histological comparison of cancer of the stomach in autopsy--and operation--cases. Jpn J Cancer Res 1949;40:199-201.\n\n[3] Hayashida K, Isomoto H, Shirouzu K, et aL A study of invasive colorectal carcinoma with reference mainly to vessel invasion and budding. Nippon Dai- cho-komonbyo Gakkai Zasshi 1987;40:119-26.\n\n[4] Rogers, A. C. et al. Systematic review and meta-analysis of the impact of tumour budding in colorectal cancer. Br. J. Cancer 115, 831–840 (2016).\n\n[5] Ueno H, Kajiwara Y, Shimazaki H, Shinto E, Hashiguchi Y, Nakanishi K, et al. New criteria for histologic grading of colorectal cancer. Am J Surg Pathol. 2012;36:193–201. ","Group":"Tumor Budding Epithelial","Masks":[],"Name":"Tumor Budding [Tumor Markers]","Overlays":[{"height":0.0473306154328444,"width":0.0750810060288871,"x":0.6896834716437,"y":0.487993036181762}],"Pan":[0.718818138855538,0.513807466249838],"Zoom":6.65531172834508},{"ActiveMasks":[],"Arrows":[{"Angle":310,"HideArrow":false,"Point":[0.734314594092866,0.513752814745281],"Text":"Tumor Budding Cell(s)"},{"Angle":310,"HideArrow":false,"Point":[0.722751931344515,0.500429340410887],"Text":"Tumor Budding Cell(s)"},{"Angle":310,"HideArrow":false,"Point":[0.711834899511046,0.490157939492301],"Text":"Tumor Budding Cell(s)"},{"Angle":60,"HideArrow":true,"Point":[0.700683092799439,0.519739574137828],"Text":"Main Tumor Mass"},{"Angle":60,"HideArrow":true,"Point":[0.740418740924483,0.482175593635571],"Text":"Main Tumor Mass"},{"Angle":120,"HideArrow":false,"Point":[0.727506122626832,0.508939929743429],"Text":"FOXP3+ Treg"},{"Angle":120,"HideArrow":false,"Point":[0.735194999885888,0.528367550909441],"Text":"Macrophages (PD-L1 Positive)"},{"Angle":120,"HideArrow":false,"Point":[0.711893593230581,0.500722809008561],"Text":"FOXP3+ Treg"},{"Angle":310,"HideArrow":false,"Point":[0.73190815159194,0.506650874681573],"Text":"Sparse CD8+ Cytotoxic T Cells"},{"Angle":310,"HideArrow":true,"Point":[0.752509647148647,0.541221475487557],"Text":"Lymphocyte Aggregate with abundant CD4 and CD8 T cells"}],"Description":"Immune populations were segmented into broad functional categories by lineage-specific marker expression:\n\nCytotoxic T Cell - CD45/CD3/CD8+ \n\nActivated Cytotoxic T Cell - CD45/CD3/CD8/PD-1+\n\nHelper T Cell - CD45/CD3/CD4+\n\nT Regulatory Cells - CD45/CD3/FOXP3+, CD4 or CD8\n\nMacrophages - CD45, CD68 or CD163\n\nNearest neighbor analysis and spatial correlation showed that the tumor budding region exhibited a distinctive immune microenvironment. Tumor budding cells at the tumor invasive front exhibited higher levels of PD-L1 staining. There were increased numbers of FOXP3+ Tregs in the budding microenvironment, and an increased number of PD-L1 positive macrophages. There were a reduced number of CD8-positive cytotoxic T cells in the budding niche, and those that were present were negative for PD1 suggesting that they were not activated. Collectively, these results suggest that the tumor budding network exists in an immunosuppressive environment that may facilitate stromal invasion and metastasis. ","Group":"Tumor Budding Immune Modulation","Masks":[],"Name":"Tumor Budding [Immune Markers]","Overlays":[{"height":0.0474658457626525,"width":0.0799211249166029,"x":0.683685023596169,"y":0.486997982182443}],"Pan":[0.72093301316954,0.512300720047842],"Zoom":7.9863740740141},{"ActiveMasks":[],"Arrows":[{"Angle":360,"HideArrow":false,"Point":[0.859131958911064,0.501037051156166],"Text":"Superficial mucosal epithelium with typical mucosal molecular pattern (ROI1-like)"},{"Angle":60,"HideArrow":true,"Point":[0.825958268630008,0.483358502832291],"Text":"Adenocarcinoma, with glandular architecture"},{"Angle":60,"HideArrow":true,"Point":[0.853145199518517,0.528223982044675],"Text":"Adenocarcinoma, with solid architecture"},{"Angle":60,"HideArrow":true,"Point":[0.892728243972771,0.470117199705245],"Text":"Bowel Lumen"},{"Angle":180,"HideArrow":false,"Point":[0.786269474266984,0.528357505588102],"Text":"Atypical deep mucosal epithelium, with molecular pattern resembling glandular adenocarcinoma (ROI2-4-like)"}],"Description":"Machine-learning based analysis of tumor molecular expression patterns derived from training on exemplar morphologic regions (ROI1-7) revealed regions with atypical expression patterns, as well as those with transitional or indeterminate morphologic and molecular patterns. \n\nHistologic review of the H&E stained sections showed a region of mucosal epithelium without overt adenomatous or high-grade dysplastic changes surrounded by tumor in the exophytic region of the tumor mass, though definitive histologic analysis is challenging in this setting given reactive changes and tissue distortion by tumor mass effect. Molecular clustering analysis showed that while superifical regions of epithelium in this region exhibited an expression pattern typical for normal mucosa (ROI1), the deeper crypt epithelium exhibited a molecular pattern more closely resembling regions of moderately differentiated invasive adenocarcinoma with glandular morphology (ROI2-4). \n\nWhile the molecular expression pattern is informed by the full array of high-plex tissue markers and not easily amenable to reduction to specific markers, the deep epithelium noticably exhibited markedly elevated proliferative cell cycle activity as assessed by PCNA and Ki-67, and reduced expression of E-cadherin, PanCK, and NaK ATPase relative to more superficial regions of epithelium, which may also be noted on surrounding regions of invasive adenocarcinoma. These findings suggest that while the deeper regions of epithelium exhibit no definitive carcinomatous changes, they have acquired an atypical molecular pattern readily identifiable by molecular profiling, and may represent regions of residual adenomatous or pre-neoplastic epithelium associated with the frankly invasive adenocarcinomatous mass. ","Group":"Histology","Masks":[],"Name":"Transitions - Atypical Mucosa/Glandular Adenocarcinoma [Histology]","Overlays":[{"height":0.0842372262763123,"width":0.100929720112003,"x":0.777496964571449,"y":0.463914768060275}],"Pan":[0.815741853917366,0.506602504369754],"Zoom":4.6217442557952},{"ActiveMasks":[],"Arrows":[{"Angle":180,"HideArrow":false,"Point":[0.785798169926556,0.528651051827187],"Text":"Atypical deep mucosal epithelium, with molecular pattern resembling glandular adenocarcinoma (ROI2-4-like)"},{"Angle":360,"HideArrow":false,"Point":[0.859836775496506,0.49932297405005],"Text":"Superficial mucosal epithelium with typical mucosal molecular pattern (ROI1-like)"},{"Angle":60,"HideArrow":true,"Point":[0.893137244211757,0.469234225667742],"Text":"Bowel Lumen"},{"Angle":60,"HideArrow":true,"Point":[0.81081578094106,0.484447637771156],"Text":"Adenocarcinoma, with glandular architecture"},{"Angle":166,"HideArrow":true,"Point":[0.857892839505514,0.530087874081399],"Text":"Adenocarcinoma, with solid architecture"}],"Description":"Machine-learning based analysis of tumor molecular expression patterns derived from training on exemplar morphologic regions (ROI1-7) revealed regions with atypical expression patterns, as well as those with transitional or indeterminate morphologic and molecular patterns. \n\nHistologic review of the H&E stained sections showed a region of mucosal epithelium without overt adenomatous or high-grade dysplastic changes surrounded by tumor in the exophytic region of the tumor mass, though definitive histologic analysis is challenging in this setting given reactive changes and tissue distortion by tumor mass effect. Molecular clustering analysis showed that while superifical regions of epithelium in this region exhibited an expression pattern typical for normal mucosa (ROI1), the deeper crypt epithelium exhibited a molecular pattern more closely resembling regions of moderately differentiated invasive adenocarcinoma with glandular morphology (ROI2-4). \n\nWhile the molecular expression pattern is informed by the full array of high-plex tissue markers and not easily amenable to reduction to specific markers, the deep epithelium noticably exhibited markedly elevated proliferative cell cycle activity as assessed by PCNA and Ki-67, and reduced expression of E-cadherin, PanCK, and NaK ATPase relative to more superficial regions of epithelium, which may also be noted on surrounding regions of invasive adenocarcinoma. These findings suggest that while the deeper regions of epithelium exhibit no definitive carcinomatous changes, they have acquired an atypical molecular pattern readily identifiable by molecular profiling, and may represent regions of residual adenomatous or pre-neoplastic epithelium associated with the frankly invasive adenocarcinomatous mass. ","Group":"Transitions","Masks":[],"Name":"Transitions - Atypical Mucosa/Glandular Adenocarcinoma [CyCIF]","Overlays":[{"height":0.0820679064023069,"width":0.101169190487705,"x":0.777847925064133,"y":0.466849325883803}],"Pan":[0.804047392340123,0.50686721376622],"Zoom":4.6217442557952},{"ActiveMasks":[],"Arrows":[{"Angle":360,"HideArrow":false,"Point":[0.822563231202727,0.479472250295616],"Text":"Adenocarcinoma, with glandular architecture"},{"Angle":360,"HideArrow":false,"Point":[0.823639282727532,0.456092585347596],"Text":"Adenocarcinoma, with solid and signet ring cell morphology"}],"Description":"Analysis of molecular expression clusters derived from ROI analysis revealed that many regions of tumor epithelium exhibit mixed or transitional expression patterns. \n\nSome regions of tumor (including the field shown) smoothly transition, or rapidly oscillate, between regions of solid architecture (ROI5-like) and glandular architecture (ROI3-like) in adjacent epithelium. While broad morphologic changes are observable on visual review of H&E histology, molecular analysis of high dimensional imaging data illuminates the remarkable degree of heterogeneity in differentiation and architecture in even small regions of tumor. Moreover, analysis of transitional regions in high dimensional space reveals a continuous gradient of expression states between exemplars of each morphologic or expression group, suggesting that many cells lie in an intermediate differentiation state not readily identifiable by morphologic review or analysis of small groups of markers. These results further suggest that some tumors may exhibit highly plastic phenotypes, with rapid shift between different molecular and morphologic states in closely contiguous regions of tumor. \n\nHigh-dimensional molecular clusters are informed by the entire panel of markers and are not easily demonstrable by limited sets of markers, though the transitional changes in morphologic features may be highlighted by PanCK which demonstrates the tissue distribution and organization of epithelial cells. ","Group":"Histology","Masks":[],"Name":"Transitions - Glandular/Solid [Histology]","Overlays":[{"height":0.0527754361483539,"width":0.0651500286836028,"x":0.777662535758623,"y":0.449293896168151}],"Pan":[0.794245580827177,0.472953356472153],"Zoom":5.54609310695424},{"ActiveMasks":[],"Arrows":[{"Angle":360,"HideArrow":false,"Point":[0.837603550886017,0.47612859654803],"Text":"Adenocarcinoma, with glandular architecture"},{"Angle":360,"HideArrow":false,"Point":[0.798454839956321,0.455761875869462],"Text":"Adenocarcinoma, with solid architecture"},{"Angle":360,"HideArrow":false,"Point":[0.846348915096699,0.460809535749453],"Text":"Adenocarcinoma, with solid architecture"},{"Angle":180,"HideArrow":false,"Point":[0.781844517327979,0.489628152041029],"Text":"Adenocarcinoma, with glandular architecture"}],"Description":"Analysis of molecular expression clusters derived from ROI analysis revealed that many regions of tumor epithelium exhibit mixed or transitional expression patterns. \n\nSome regions of tumor (including the field shown) smoothly transition, or rapidly oscillate, between regions of solid architecture (ROI5-like) and glandular architecture (ROI3-like) in adjacent epithelium. While broad morphologic changes are observable on visual review of H&E histology, molecular analysis of high dimensional imaging data illuminates the remarkable degree of heterogeneity in differentiation and architecture in even small regions of tumor. Moreover, analysis of transitional regions in high dimensional space reveals a continuous gradient of expression states between exemplars of each morphologic or expression group, suggesting that many cells lie in an intermediate differentiation state not readily identifiable by morphologic review or analysis of small groups of markers. These results further suggest that some tumors may exhibit highly plastic phenotypes, with rapid shift between different molecular and morphologic states in closely contiguous regions of tumor. \n\nHigh-dimensional molecular clusters are informed by the entire panel of markers and are not easily demonstrable by limited sets of markers. However, one many note relatively reduced expression of E-cadherin and PCNA in regions of solid architecture, which is also noted in ROI5.","Group":"Transitions","Masks":[],"Name":"Transitions - Glandular/Solid [CyCIF]","Overlays":[{"height":0.0757148981998627,"width":0.0799408460063666,"x":0.76429509518708,"y":0.434397361958803}],"Pan":[0.784145411215789,0.472389615454898],"Zoom":4.6217442557952},{"ActiveMasks":[],"Arrows":[{"Angle":360,"HideArrow":false,"Point":[0.715086358932731,0.404547739101745],"Text":"Adenocarcinoma, with solid and signet ring cell morphology"},{"Angle":360,"HideArrow":false,"Point":[0.713032078749014,0.432016399844021],"Text":"Adenocarcinoma, with mucinous morphology"}],"Description":"Analysis of molecular expression clusters derived from ROI analysis revealed that many regions of tumor epithelium exhibit mixed or transitional expression patterns. \n\nWhile broad morphologic changes are observable on visual review of H&E histology, molecular analysis of high dimensional imaging data illuminates the remarkable degree of heterogeneity in differentiation and architecture in even small regions of tumor. Moreover, analysis of transitional regions in high dimensional space reveals a continuous gradient of expression states between exemplars of each morphologic or expression group, suggesting that many cells lie in an intermediate differentiation state not readily identifiable by morphologic review or analysis of small groups of markers. \n\nThese results further suggest that some tumors may exhibit highly plastic phenotypes, with rapid shift between different molecular and morphologic states in closely contiguous regions of tumor. ","Group":"Histology","Masks":[],"Name":"Transitions - Solid/Mucinous [Histology]","Overlays":[{"height":0.0655608847203462,"width":0.0609240808770988,"x":0.672474718550482,"y":0.378018177872026}],"Pan":[0.686441104293455,0.409558554502176],"Zoom":5.54609310695424},{"ActiveMasks":[],"Arrows":[{"Angle":360,"HideArrow":false,"Point":[0.717283333549791,0.396108533420069],"Text":"Adenocarcinoma, with solid and signet ring cell morphology"},{"Angle":360,"HideArrow":false,"Point":[0.711599065547207,0.430697908925159],"Text":"Adenocarcinoma, with mucinous features"},{"Angle":60,"HideArrow":true,"Point":[0.649314001263566,0.444122456761051],"Text":"Mucosa"}],"Description":"Analysis of molecular expression clusters derived from ROI analysis revealed that many regions of tumor epithelium exhibit mixed or transitional expression patterns. \n\nWhile broad morphologic changes are observable on visual review of H&E histology, molecular analysis of high dimensional imaging data illuminates the remarkable degree of heterogeneity in differentiation and architecture in even small regions of tumor. Moreover, analysis of transitional regions in high dimensional space reveals a continuous gradient of expression states between exemplars of each morphologic or expression group, suggesting that many cells lie in an intermediate differentiation state not readily identifiable by morphologic review or analysis of small groups of markers. \n\nThese results further suggest that some tumors may exhibit highly plastic phenotypes, with rapid shift between different molecular and morphologic states in closely contiguous regions of tumor. ","Group":"Transitions","Masks":[],"Name":"Transitions - Solid/Mucinous [CyCIF]","Overlays":[{"height":0.0656714367107122,"width":0.0660947332640962,"x":0.673804730423638,"y":0.376576421028209}],"Pan":[0.68979329540089,0.409378034033279],"Zoom":5.54609310695424}]}]}