{"Name": "Lateral Left Ventricle", "Images": [{"Name": "i0", "Description": "Lateral Left Ventricle", "Path": "https://s3.amazonaws.com/www.cycif.org/rashid-perspective-MI-2019", "Width": 107536, "Height": 67301, "MaxLevel": 7}], "Layout": {"Grid": [["i0"]]}, "Groups": [{"Path": "477593", "Name": "H&E", "Colors": ["8233CC", "FF8080"], "Channels": ["Hematoxylin", "Eosin"]}], "Stories": [{"Name": "", "Waypoints": [{"Name": "Layers of the Heart Wall", "Group": "H&E", "Description": "The first organ to form during fetal development, the heart \nis responsible for pumping blood through the circulatory system\nto supply oxygen to all cells of the body. In humans, the heart is \nlocated in the chest cavity between the lungs and sits in a fuild-filled sac\ncalled the pericardium which serves to protect this vital organ.\n\nThe heart wall is comprised of three layers`:` the \n1) epicardium, 2) myocardium, and the 3) endocardium.\n\nThe epicardium is the outer most layer and is contiguous with the visceral\nlayer of the pericardium. It is composed primarily of adipose tissue, connective \ntissue including elastic fibers, and mesothelium, which secrete pericardial fluid \nto help lubricate the heart and reduce friction as it expands in volume.\nThe epicardium also contains coronary blood vessels that supply blood to the heart wall.\n\nThe middle layer, or the myocardium, is composed of cardiac muscle \nfibers (cardiomyocytes) that generate the contractile force \nneeded to pump blood. These contractions are signaled by the peripheral \nnervous system and synchronized by Purkinje fibers. The myocardium \nis the thickest layer of the heart wall, with its thickness varying\nin different parts of the heart. The myocardium of the left ventricle\nis the thickest as this ventricle is responsible for generating \nenough power to pump blood through the aorta to the rest of the body. \nOn average, an adult heart pumps ~6000-75000 liters of blood daily.\n\nThe endocardium is the innermost layer of the heart wall. It lines the \ninside of chambers and the valves with a simple squamous epithelium, \nor a single layer of flat cells. This type of epithelium enables rapid \ndiffusion of small molecules.\n\nIn this view of the lateral left ventricle wall, epicardial fat is seen on one \nside of the section and papillary muscles present on the opposite side which \nis the left ventricle lumen.\n", "Zoom": 0.4542, "Pan": [0.5741, 0.5], "Arrows": [{"Point": [0.7965404496094648, 0.17584738837480915], "Text": "epicardium", "HideArrow": true, "Angle": 60}, {"Point": [0.8029856804779639, 0.5740902043980588], "Text": "myocardium", "HideArrow": true, "Angle": 60}, {"Point": [0.7859504153523912, 0.8483114525139663], "Text": "endocardium", "HideArrow": true, "Angle": 60}], "Overlays": [{"x": 0.3638, "y": 0.0293, "width": 1.1911, "height": 0.3079}, {"x": 0.3483, "y": 0.3227, "width": 1.0566, "height": 0.4527}, {"x": 0.3416, "y": 0.7871, "width": 1.0436, "height": 0.1672}]}, {"Name": "Papillary Muscle", "Group": "H&E", "Description": "The ventricles of the heart contain papillary muscles that attach to \natrioventricular valves and contract to prevent inversion of the valves \nand backflow of blood during systole.\n\nIn the center of one of the papillary muscles is a region of acute ischemia \nwith mildly increased eosinophilia (approximately 12-24 hours). \n\nPeripherally, there is a layer of 5-8 myocytes that are viable but vacuolated. \nThese myocytes are alive because of their proximity to the ventricular lumen \nwhere the blood pumping through the heart provides for the metabolic needs so \nas to prevent infarction and death of those peripherally located cells. \n\nOften, when there is infarction of the papillary muscles of the left ventricle \nwhich anchor the mitral valve leaflets via the chordae tendineae, there is \nmitral valve dysfunction and prominent regurgitation that can result in rapid \nback flow of blood down the low hemodynamic pressure of the left atrium, and \nthe left veins into the lung. The result is flash pulmonary edema with a rapid \naccumulation of fluid in the pulmonary interstitium and emergent respiratory distress.\n", "Zoom": 6.1051, "Pan": [0.7183, 0.8761], "Overlay": {"x": 0.6737, "y": 0.8377, "width": 0.1076, "height": 0.0815}}]}]}