{
    "Images": [
        {
            "Name": "i0",
            "Description": "Exploring the stages of tuberculosis granulomas",
            "Path": "https://s3.amazonaws.com/www.cycif.org/tuberculosis-granulomas/cycif-and-he",
            "Width": 42992,
            "Height": 33045,
            "MaxLevel": 6
        }
    ],
    "Header": "Within tuberculosis (TB)-infected lungs, granulomas are the sites of chronic lung inflammation caused by the bacteria Mycobacterium tuberculosis (Mtb) and the host immune response. Mtb growth is often limited within a granuloma, but these sites provide a niche from which bacteria can persist or spread. Although the classical structure of granulomas was described around 200 years ago, there is still much unknown about the specific molecular mechanisms that contribute to the progression of TB from an active to a latent infection (and vice versa).\n\nHere, we use two images of a TB-infected lung to illustrate how TB granulomas progress during the disease. First, we show H&E images – a clinical standard for TB diagnosis. Second, we use highly multiplexed imaging to reveal molecular insight into what’s happening at each stage.\n\nWe recommend that you look at the [first story in the series](./features.html) to get oriented to the tissue sample before going through this story.",
    "Rotation": 0,
    "Layout": {
        "Grid": [
            [
                "i0"
            ]
        ]
    },
    "FirstGroup": "H and E",
    "Stories": [
        {
            "Name": "",
            "Description": "",
            "Waypoints": [
                {
                    "Name": "Progression of the TB granuloma – H&E",
                    "Description": "Within this lung, there are several granulomas that represent different stages of tuberculosis. \n\n1. Necrotic (active infection)\n\n2. Resolving \n\n3. Fibrotic (healed)\n\nHere, you see an H&E-stained tissue slice – this represents the type of image that pathologists use to diagnose TB.\n",
                    "Arrows": [
                        {
                            "Text": "Fibrotic",
                            "HideArrow": false,
                            "Point": [
                                0.7566170841744003,
                                0.5494083750968527
                            ],
                            "Angle": 60
                        },
                        {
                            "Text": "Resolving",
                            "HideArrow": false,
                            "Point": [
                                0.26750287970998743,
                                0.6273662270437933
                            ],
                            "Angle": 321
                        },
                        {
                            "Text": "Necrotic",
                            "HideArrow": false,
                            "Point": [
                                0.9136349972230149,
                                0.4016369647781956
                            ],
                            "Angle": 60
                        }
                    ],
                    "Overlays": [],
                    "Group": "H and E",
                    "Masks": [],
                    "ActiveMasks": [],
                    "Zoom": 0.5054794520547946,
                    "Pan": [
                        0.4250343481167766,
                        0.46280896880673755
                    ]
                },
                {
                    "Name": "Progression of the TB granuloma – t-CyCIF",
                    "Description": "Here, we show a multiplexed image from the same lung sample.\n\nTissue cyclic immunofluorescence (t-CyCIF) is a method for iterative antibody staining of one tissue sample with 20-60 protein markers. Multiplexed images from t-CyCIF provide a more thorough characterization of tissue architecture, functional states of individual cells, and their interactions to give a more complete understanding of the TB granulomas.\n\nWithin t-CyCIF images, you can switch channel groups at any time (upper right corner) to see different markers in the same area or use the back arrow to compare with the H&E images.\n\nThis image highlights two markers to showcase the tissue architecture – alpha-smooth muscle actin (`aSMA`) and keratin (`panCK`). *You can zoom in on the labeled granulomas for more details.*\n\nIn the following story, we illustrate the different stages of the internal battle of the immune system against the tuberculosis bacteria.\n",
                    "Arrows": [
                        {
                            "Text": "Fibrotic Granuloma",
                            "HideArrow": false,
                            "Point": [
                                0.7198167915759013,
                                0.529414926342904
                            ],
                            "Angle": 170
                        },
                        {
                            "Text": "Resolving Granuloma",
                            "HideArrow": false,
                            "Point": [
                                0.3460698345369997,
                                0.6898465187328339
                            ],
                            "Angle": 336
                        },
                        {
                            "Text": "Necrotic Granuloma",
                            "HideArrow": false,
                            "Point": [
                                0.8861417990494367,
                                0.4607512875438484
                            ],
                            "Angle": 60
                        }
                    ],
                    "Overlays": [
                        {
                            "x": 0.7239976429763973,
                            "y": 0.5042909941347232,
                            "width": 0.05255965520866179,
                            "height": 0.04888047934405548
                        },
                        {
                            "x": 0.18610828087392134,
                            "y": 0.6167314865309743,
                            "width": 0.14751986560301494,
                            "height": 0.11740756313971912
                        },
                        {
                            "x": 0.683536470850188,
                            "y": 0.31168728691279063,
                            "width": 0.22146649230551374,
                            "height": 0.13993762335537285
                        }
                    ],
                    "Group": "Tissue architecture",
                    "Masks": [],
                    "ActiveMasks": [],
                    "Zoom": 0.7858929810700601,
                    "Pan": [
                        0.5400171180252648,
                        0.5148078617366859
                    ]
                },
                {
                    "Name": "The battle begins: Necrotic granulomas",
                    "Description": "When the tuberculosis infection is active, immune cells in the area notice the Mtb and trigger an inflammatory response to try to get rid of the bacteria. Macrophages in the lung phagocytose (eat) the bacteria as an attempt to kill the invaders, but it’s futile - Mtb have evolved to survive inside of the macrophages. \n\nAfter immune cells detect the Mtb, cells in the lung form a granuloma as an attempt to wall-off the bacteria and prevent its spread. Fibroblasts and macrophages enclose the tuberculosis infection with scar tissue, shown as a **fibrotic ring**.\n\nMeanwhile, more immune cells are attracted to the granuloma to try to fight off the bacteria, and as this battle wages, many cells die. This dead cell debris fills the center of the necrotic granuloma, resulting in a homogeneous and nuclei-free core, known as a **caseous granuloma**.  \n\nThe dead cell debris is made up of immune cells and cells that normally make up the alveoli. Functional lung tissue is permanently destroyed by these granulomas.",
                    "Arrows": [
                        {
                            "Text": "Caseous necrotic core",
                            "HideArrow": true,
                            "Point": [
                                0.843750013039002,
                                0.388488136254482
                            ],
                            "Angle": 60
                        },
                        {
                            "Text": "Fibrotic ring",
                            "HideArrow": false,
                            "Point": [
                                0.8372880026316527,
                                0.35683797039800436
                            ],
                            "Angle": 0
                        }
                    ],
                    "Overlays": [],
                    "Group": "H and E",
                    "Masks": [],
                    "ActiveMasks": [],
                    "Zoom": 4.209480151025105,
                    "Pan": [
                        0.830191101732681,
                        0.4009809814400276
                    ]
                },
                {
                    "Name": "The battle begins: Immune response in a necrotic granuloma",
                    "Description": "As the body mounts an immune response, immune cells aggregate on the edge of the granuloma. We will elaborate on the clusters of **B and T cells** (`CD20` and `CD3D`, respectively) in the next stage of TB progression as they become more formed.\n\nThe core of the necrotic granuloma is filled with **macrophage** (`CD68`) debris. Because Mtb can survive and replicate in macrophages, these macrophages eventually die and propagate the infection. This is the reason why the majority of the `CD68` staining in the core is not associated with nuclei staining (`DNA1`).\n\n",
                    "Arrows": [],
                    "Overlays": [
                        {
                            "x": 0.6949467227185595,
                            "y": 0.3068273618052396,
                            "width": 0.21497661213729302,
                            "height": 0.14804993178846004
                        }
                    ],
                    "Group": "Immune cells",
                    "Masks": [],
                    "ActiveMasks": [],
                    "Zoom": 3.536633996069807,
                    "Pan": [
                        0.8081008432941621,
                        0.37953314926903803
                    ]
                },
                {
                    "Name": "A fighting chance: Resolving granulomas",
                    "Description": "Eventually, cells involved in wound healing – such as fibroblasts, endothelial cells, macrophages, and other immune cells – enter the necrotic core. These cells work together to clear out the necrotic debris and replace this debris with scar tissue.\n\nThese resolving granulomas are identified in H&E images by the presence of purple cell nuclei invading the necrotic core. \n\nThe immune system is highly active at this stage - at the periphery of the granuloma, **immune follicles** begin to form, visible as the dark purple clusters of immune cells at the edges of the granuloma. These follicles contain a variety of immune cells – the specific types can’t be determined from this H&E image.",
                    "Arrows": [
                        {
                            "Text": "Cells infiltrating",
                            "HideArrow": false,
                            "Point": [
                                0.23478883666220457,
                                0.6363002681737424
                            ],
                            "Angle": 60
                        },
                        {
                            "Text": "Immune follicle",
                            "HideArrow": false,
                            "Point": [
                                0.26739405790486526,
                                0.6171260821458194
                            ],
                            "Angle": 43
                        }
                    ],
                    "Overlays": [],
                    "Group": "H and E",
                    "Masks": [],
                    "ActiveMasks": [],
                    "Zoom": 4.50690556904995,
                    "Pan": [
                        0.22098251222258086,
                        0.6456235497885616
                    ]
                },
                {
                    "Name": "A fighting chance: Immune population in a resolving granuloma",
                    "Description": "A variety of immune cells work together to clear the infection in resolving granulomas.\n\nMore functioning **macrophages (`CD68`)** are seen at this stage in the granuloma. Those that surround and interact with the B and T cells perform as antigen presenting cells. Other macrophages in the core continue to phagocytose Mtb. \n\n**B cells (`CD20`)** aggregate at the edge of the granuloma. They are responsible for antibody production. \n\n**T cells (`CD3D`)** gather at the edges of B cell aggregates (follicles) and promote antibody development. \n\nA closer look at the T cell population reveals two types of T cells, **cytotoxic T cells (`CD8A`)** and **T helper cells (`CD4`)**. *Switch to the T cells channel group to see them* \n\nCytotoxic T cells can directly eliminate infected macrophages. T helper cells instruct macrophages to kill Mtb and interact with the aggregated B cells to inform antibody development.\n",
                    "Arrows": [
                        {
                            "Text": "Immune cell aggregate",
                            "HideArrow": false,
                            "Point": [
                                0.2829570596536033,
                                0.6480439586083374
                            ],
                            "Angle": 60
                        },
                        {
                            "Text": "",
                            "HideArrow": false,
                            "Point": [
                                0.2132319881111655,
                                0.651777487813112
                            ],
                            "Angle": 60
                        },
                        {
                            "Text": "",
                            "HideArrow": false,
                            "Point": [
                                0.23020385924172043,
                                0.6911720499993635
                            ],
                            "Angle": 60
                        },
                        {
                            "Text": "",
                            "HideArrow": false,
                            "Point": [
                                0.2925166415677725,
                                0.7199127368773837
                            ],
                            "Angle": 60
                        },
                        {
                            "Text": "",
                            "HideArrow": false,
                            "Point": [
                                0.2941271110911099,
                                0.6774211179154833
                            ],
                            "Angle": 60
                        },
                        {
                            "Text": "",
                            "HideArrow": false,
                            "Point": [
                                0.3046571041283155,
                                0.7124798006158267
                            ],
                            "Angle": 60
                        }
                    ],
                    "Overlays": [
                        {
                            "x": 0.18420764194825395,
                            "y": 0.6212183604605559,
                            "width": 0.13921431511581372,
                            "height": 0.11086213142759316
                        }
                    ],
                    "Group": "Immune cells",
                    "Masks": [],
                    "ActiveMasks": [],
                    "Zoom": 4.20426045648,
                    "Pan": [
                        0.23887561821353684,
                        0.6774830590509963
                    ]
                },
                {
                    "Name": "Immune system wins: Fibrotic granulomas",
                    "Description": "Eventually, immune cells clear the necrotic debris from the core. A debris-clearing giant cell (made of fused macrophages) is prominent within this tissue. B and T cells are also still present – the numerous, small, purple nuclei visible on the right of the granuloma are likely mix of B and T cells.\n\nBy this point, fibroblasts have replaced the granuloma core with a scar tissue made of rigid structural proteins like collagen. The resulting fibrotic granuloma is quite distinct from the original alveolar structure of the lung - unfortunately, lung function in this healed granuloma is permanently lost. \n\nIt’s not known if bacteria are still present in the fibrotic granuloma at this point. In this patient biopsy, no bacteria were visible with acid-fast staining (a stain that identifies Mtb), but histological samples represent only a two-dimensional slice of the three-dimensional granuloma. The presence of numerous necrotic (caseous) granulomas in this patient suggests ongoing Mtb infection despite not detecting bacteria in the biopsy. In addition to a biopsy, clinicians use additional methods for diagnosing infection status, such as a sputum culture, where a sample of phlegm from a patient’s cough is collected and monitored for several days to see if any bacteria grow within the sample.",
                    "Arrows": [
                        {
                            "Text": "Fibrotic region",
                            "HideArrow": true,
                            "Point": [
                                0.7557743542686544,
                                0.5509545139776539
                            ],
                            "Angle": 60
                        },
                        {
                            "Text": "Giant cell",
                            "HideArrow": false,
                            "Point": [
                                0.7554191092389078,
                                0.5387199571744536
                            ],
                            "Angle": 60
                        },
                        {
                            "Text": "Immune cells",
                            "HideArrow": false,
                            "Point": [
                                0.7706163354037746,
                                0.5385746163656249 
                            ],
                            "Angle": 284
                        },
                        {
                            "Text": "Fibroblast-like cells",
                            "HideArrow": false,
                            "Point": [
                                0.7559780073165417,
                                0.5320238228349062
                            ],
                            "Angle": 270
                        }
                    ],
                    "Overlays": [
                        {
                            "x": 0.7519978792692077,
                            "y": 0.5346166995272853,
                            "width": 0.005580740127354544,
                            "height": 0.00525448018590835
                        }
                    ],
                    "Group": "H and E",
                    "Masks": [],
                    "ActiveMasks": [],
                    "Zoom": 11.214623265578368,
                    "Pan": [
                        0.7467687125734671,
                        0.5344902754226205
                    ]
                },
                {
                    "Name": "Immune system wins: Immune population in a fibrotic granuloma",
                    "Description": "In the fibrotic granuloma, **macrophages (`CD68`)** and fibroblasts take over the once cell-free, necrotic core. You can see their numbers by the nucleus staining in the `DNA1` channel.\n\nA giant cell is seen in this granuloma, stained with macrophage marker (`CD68`). They are a hallmark of mycobacterial diseases, including TB. \n\nThough it looks like the battle in this granuloma has concluded, TB can remain latent for an extended period. A patient can have inactive disease for 30-40 years then suddenly have the disease re-activate and develop new necrotic granulomas. \n\nHow TB progresses from a latent to an active infection (and vice versa) is not yet well understood. Specifically, why Mtb replication can be controlled in some regions of the lung (such as fibrotic granulomas) while replication simultaneously continues in another region of the lung (such as necrotic granulomas) is an active area of research investigation.",
                    "Arrows": [
                        {
                            "Text": "Giant Cell",
                            "HideArrow": false,
                            "Point": [
                                0.7438626769931608,
                                0.5384076745498458
                            ],
                            "Angle": 60
                        }
                    ],
                    "Overlays": [
                        {
                            "x": 0.7194809187402977,
                            "y": 0.5062444158170153,
                            "width": 0.05794031885698159,
                            "height": 0.04718346641095972
                        },
                        {
                            "x": 0.7349220557508258,
                            "y": 0.5337899910510574,
                            "width": 0.00849850260947227,
                            "height": 0.0073686438810453
                        }
                    ],
                    "Group": "Immune cells",
                    "Masks": [],
                    "ActiveMasks": [],
                    "Zoom": 8.375191381942816,
                    "Pan": [
                        0.7386371824733688,
                        0.5293295402938318
                    ]
                },
                {
                    "Name": "CyCIF Free Explore",
                    "Description": "",
                    "Arrows": [],
                    "Overlays": [],
                    "Group": "Tissue architecture",
                    "Groups": ["T cells", "Immune cells", "Tissue architecture"],
                    "Masks": [],
                    "ActiveMasks": [],
                    "Zoom": 0.5,
                    "Pan": [
                        0.65,
                        0.5
                    ]
                }
            ]
        }
    ],
    "Groups": [
        {
            "Name": "T cells",
            "Path": "T-cells_33__CD4--43__CD8A--0__DNA1--46__panCK",
            "Colors": [
                "ff00ff",
                "f5fc2a",
                "0000ff",
                "ffffff"
            ],
            "Channels": [
                "CD4",
                "CD8A",
                "DNA1",
                "panCK"
            ]
        },
        {
            "Name": "Immune cells",
            "Path": "Immune-cells_14__CD3D--47__CD20--34__CD68--0__DNA1--46__panCK",
            "Colors": [
                "00ff00",
                "ff0000",
                "00ffff",
                "0000ff",
                "ffffff"
            ],
            "Channels": [
                "CD3D",
                "CD20",
                "CD68",
                "DNA1",
                "panCK"
            ]
        },
        {
            "Name": "Tissue architecture",
            "Path": "Tissue-architecture_38__aSMA--46__panCK--0__DNA1",
            "Colors": [
                "ff00ff",
                "ffffff",
                "0000ff"
            ],
            "Channels": [
                "aSMA",
                "panCK",
                "DNA1"
            ]
        },
        {
            "Name": "H and E",
            "Path": "H-and-E_0__0--1__1--2__2",
            "Colors": [
                "aa00aa",
                "ffaaff"
            ],
            "Channels": [
                "Hematoxylin",
                "Eosin"
            ]
        }
    ],
    "Masks": []
}
