{"Name": "Ependymoma", "Images": [{"Name": "i0", "Description": "Ependymoma [Case #1] - Coy S, et al. Acta Neuropathologica. 2019", "Path": "https://s3.amazonaws.com/www.cycif.org/coy-acta-neuropathologica-2019", "Width": 39969, "Height": 41702, "MaxLevel": 6}], "Layout": {"Grid": [["i0"]]}, "Groups": [{"Path": "467168", "Name": "H&E", "Colors": ["8233CC", "FF8080"], "Channels": ["Hematoxylin", "Eosin"]}], "Stories": [{"Name": "Overview", "Description": null, "Waypoints": [{"Zoom": 0.4803, "Pan": [0.4357, 0.4513], "Group": "H&E", "Name": "The Waypoint", "Description": "Hematoxylin and Eosin (H&E) stained section of an ependymoma from an NF2 patient.\n\n#### Figure from:\n\nCoy S et al. An update on the CNS manifestations of neurofibromatosis type 2. Acta Neuropathologica. 2019 Jun 4.\n[PubMed](https://www.ncbi.nlm.nih.gov/pubmed/31161239)\n\n##### References\n1. Louis DN, Ohgaki H, Wiestler OD, Cavenee WK. W.H.O. Classification of Tumors of the Central Nervous System. Lyon:IARC/W.H.O; 2016.\n1. Plotkin SR, O'Donnell CC, Curry WT, Bove CM, MacCollin M, Nunes FP. Spinal ependymomas in neurofibromatosis Type 2:a retrospective analysis of 55 patients. J Neurosurg Spine. 2011 Apr;14(4):543-7.\n1. Ellison DW, Kocak M, Figarella-Branger D, Felice G, Catherine G, Pietsch T, et al. Histopathological grading of pediatric ependymoma:reproducibility and clinical relevance in European trial cohorts. J Negat Results Biomed. 2011. 10:7\n", "Overlay": {"x": -100, "y": -100, "width": 200, "height": 200}}]}, {"Name": "About", "Description": null, "Waypoints": [{"Name": "Ependymoma", "Group": "H&E", "Description": "Ependymomas are proliferations of neoplastic glial cells with histologic, molecular, and ultrastructural similarities to the ependymal cells of the ventricles and spinal canal (1). Ependymomas may be found in the intracranial compartment, typically within the ventricular system, or in the spinal canal. Ependymomas are identified in approximately 33-53% of individuals with NF2, most commonly involving the posterior fossa and cervicomedullary region of the spine (2). Ependymomas are often heterogeneous tumors, and may be classified into different subtypes including the classic, papillary, tanycytic, myxopapillary, clear cell, and anaplastic variants. Myxopapillary ependymomas are classified as W.H.O. grade I, while classic, papillary, clear cell, and tanycytic tumors are classified as W.H.O. grade II, and anaplastic ependymomas as W.H.O. grade III (1). However, clinicopathologic studies have failed to show a clear correlation between grade and clinical outcome in grade II and III ependymomas, and this classification may need further refinement (3). NF2-associated ependymomas may be of any histologic subtype, but the classic variant is the most commonly encountered.", "Zoom": 0.4803, "Pan": [0.4357, 0.4513], "Overlay": {"x": -100, "y": -100, "width": 200, "height": 200}}, {"Name": "Peri-Vascular Pseudo-Rosettes", "Group": "H&E", "Description": "Peri-vascular pseudo-rosettes are a characteristic histologic feature of ependymomas which may be observed in all histologic subtypes. Peri-vascular pseudo-rosettes are characterized by a radial collection of neoplastic cells surrounding a central blood vessel, with each cell extending fibrillary processes toward the vessel basement membrane resulting in a distinctive peri-vascular zone with few nuclei. Pseudo-rosettes are named in relation to \"true\" ependymal rosettes which contain a central lumen, rather than a blood vessel.", "Zoom": 15.36, "Pan": [0.684, 0.539], "Overlay": {"x": 0.662, "y": 0.523, "width": 0.044, "height": 0.035}}, {"Name": "Ependymal (True) Rosettes", "Group": "H&E", "Description": "Ependymal (true) rosettes are characterized by a collection of neoplastic cells radially arranged around a central tubular lumen. The neoplastic cells forming true ependymal rosettes may exhibit apical multi-ciliation. While peri-vascular pseudo-rosettes are found in nearly all ependymomas, true rosettes are seen only in a subset of cases.", "Zoom": 31.85, "Pan": [0.472, 0.312], "Overlay": {"x": 0.471, "y": 0.309, "width": 0.007, "height": 0.007}}, {"Name": "Papillary Architecture", "Group": "H&E", "Description": "Papillary architecture, with neoplastic cells arranged around central vascular cores, may be seen in a subset of ependymomas as with this specimen from a patient with NF2. The neoplastic cells of ependymal papillae project processes to the central blood vessel in the same architectural arrangement as other peri-vascular pseudo-rosettes. The surface of papillary fronds often exhibit multi-ciliation and a smooth surface similar to the normal ependymal lining. There is no known difference in biological behavior and clinical outcome between ependymomas with papillary architecture and those without.", "Zoom": 8.27, "Pan": [0.624, 0.335], "Overlay": {"x": 0.58, "y": 0.309, "width": 0.089, "height": 0.056}}]}]}