{"Name": "Meningioma", "Images": [{"Name": "i0", "Description": "Meningioma [Case #3] - Coy S, et al. Acta Neuropathologica. 2019", "Path": "https://s3.amazonaws.com/www.cycif.org/coy-acta-neuropathologica-2019", "Width": 119908, "Height": 71838, "MaxLevel": 7}], "Layout": {"Grid": [["i0"]]}, "Groups": [{"Path": "467167", "Name": "H&E", "Colors": ["7F4AAD", "FF8080"], "Channels": ["Hematoxylin", "Eosin"]}], "Stories": [{"Name": "Overview", "Description": null, "Waypoints": [{"Zoom": 0.4803, "Pan": [0.845, 0.468], "Group": "H&E", "Name": "The Waypoint", "Description": "Hematoxylin & Eosin (H&E) stained section of a meningioma from an NF2 patient. \n\n#### Figure from:\n\nCoy S et al. An update on the CNS manifestations of neurofibromatosis type 2. Acta Neuropathologica. 2019 Jun 4.\n[PubMed](https://www.ncbi.nlm.nih.gov/pubmed/31161239)\n\n##### References\n1. Louis DN, Ohgaki H, Wiestler OD, Cavenee WK. W.H.O. Classification of Tumors of the Central Nervous System. Lyon:IARC/W.H.O; 2016.\n1. Evans DG, King AT, Bowers NL, Tobi S, Wallace AJ, Perry M, Anup R, Lloyd SKL, Rutherford SA, Hammerbeck-Ward C, Pathmanaban ON, Stapleton E, Freeman SR, Kellett M, Halliday D, Parry A, Gair JJ, Axon P, Laitt R, Thomas O, Afridi S, Ferner RE, Harkness EF, Smith MJ; English Specialist NF2 Research Group. Identifying the deficiencies of current diagnostic criteria for neurofibromatosis 2 using databases of 2777 individuals with molecular testing. Genet Med. 2018 Dec 7.\n", "Overlay": {"x": -100, "y": -100, "width": 200, "height": 200}}]}, {"Name": "About", "Description": null, "Waypoints": [{"Name": "Meningioma", "Group": "H&E", "Description": "Meningiomas are proliferations of neoplastic cells with histologic, ultrastructural, and molecular evidence of meningothelial cell differentiation which have a wide variety of histologic appearances and genetic aberrations (1). Approximately 50% of NF2 patients develop intracranial meningiomas, most often in the supratentorial compartment and along the falx cerebri (2). While sporadic meningiomas are typically solitary lesions; NF2 patients frequently develop multiple meningiomas, and they may arise in unusual sites such as the ventricles and spinal canal. NF2-associated tumors often exhibit a higher mitotic rate than sporadic tumors, suggesting that they may have more aggressive behavior. This tumor exhibits no atypical histologic features, and would best be classified as a fibrous meningioma, W.H.O. grade I.", "Zoom": 0.4803, "Pan": [0.857, 0.447], "Overlay": {"x": 0.002, "y": 0.002, "width": 1.601, "height": 0.995}}, {"Name": "Fibrous Histology", "Group": "H&E", "Description": "NF2-associated meningiomas may be of any histologic subtype, but are most often the fibrous variant, as in this tumor from an NF2 patient. Sporadic meningiomas with NF2 gene loss are also more often of the fibrous subtype, suggesting that NF2 gene loss itself contributes to this histologic appearance though the biological mechanisms are not well understood. The fibrous variant of meningioma is characterized by short fascicles of ovoid to spindled tumor cells which may focally exhibit a whorled architecture with a prominent collagenized matrix. Typical meningothelial whorls and psammoma bodies are infrequent, if present. The histologic appearance may raise a differential of solitary fibrous tumor, but the presence of focal meningothelial features, absence of 'staghorn' vessels, and immunophenotypic features (positivity for EMA and SSTR2, absence of STAT6 in meningiomas) reliably distinguish these lesions.", "Zoom": 12.5, "Pan": [1.0757, 0.5657], "Overlay": {"x": 1.0481, "y": 0.5449, "width": 0.0594, "height": 0.0452}}, {"Name": "Psammoma Bodies", "Group": "H&E", "Description": "Psamomma bodies are spherical lamellated concentric calficiations which are associated with certain tumors including meningiomas, papillary serous carcinomas, lung adenocarcinomas, and mesotheliomas. They are a form of dystrophic calcification, and in the case of meningiomas are presumed to result from degeneration and concentric calficiation of meningothelial whorls. The presence of psammoma bodies is highly characteristic of meningothelial differentiation in intracranial or spinal tumors, and may be a helpful diagnostic feature. While fibrous meningiomas often lack psammoma bodies, they may be observed in some cases as in this tumor from an NF2 patient. This tumor also exhibits scattered vascular calcifications of uncertain significance.", "Zoom": 22.49, "Pan": [1.527, 0.436], "Overlay": {"x": 1.509, "y": 0.425, "width": 0.034, "height": 0.022}}]}]}