{"Name": "Intraneural Schwannoma (Spinal Nerve Root)", "Images": [{"Name": "i0", "Description": "Intraneural Schwannoma (Spinal Nerve Root) [Case #5] - Coy S, et al. Acta Neuropathologica. 2019", "Path": "https://s3.amazonaws.com/www.cycif.org/coy-acta-neuropathologica-2019", "Width": 70422, "Height": 54501, "MaxLevel": 7}], "Layout": {"Grid": [["i0"]]}, "Groups": [{"Path": "467159", "Name": "H&E", "Colors": ["8233CC", "FF8080"], "Channels": ["Hematoxylin", "Eosin"]}], "Stories": [{"Name": "Overview", "Description": null, "Waypoints": [{"Zoom": 0.405, "Pan": [0.592, 0.5], "Group": "H&E", "Name": "The Waypoint", "Description": "Hematoxylin and Eosin (H&E) stained section of a spinal nerve root schwannoma with intraneural growth in an NF2 patient\n\n#### Figure from:\n\nCoy S et al. An update on the CNS manifestations of neurofibromatosis type 2. Acta Neuropathologica. 2019 Jun 4.\n[PubMed](https://www.ncbi.nlm.nih.gov/pubmed/31161239)\n\n##### References\n1. Louis DN, Ohgaki H, Wiestler OD, Cavenee WK. W.H.O. Classification of Tumors of the Central Nervous System. Lyon:IARC/W.H.O; 2016.\n1. Stivaros SM, Stemmer-Rachamimov AO, Alston R, Plotkin SR, Nadol JB, Quesnel A, O'Malley J, Whitfield GA, McCabe MG, Freeman SR, Lloyd SK, Wright NB, Kilday JP, Kamaly-Asl ID, Mills SJ, Rutherford SA, King AT, Evans DG. Multiple synchronous sites of origin of vestibular schwannomas in neurofibromatosis Type 2. J Med Genet. 2015 Aug;52(8):557-62.\n", "Overlay": {"x": -100, "y": -100, "width": 200, "height": 200}}]}, {"Name": "About", "Description": null, "Waypoints": [{"Name": "Schwannoma", "Group": "H&E", "Description": "Schwannomas are proliferations of neoplastic cells which exhibit histologic, ultrastructural, and molecular similarities to the Schwann cells of the peripheral nervous system (1). Schwannomas are typically benign slow-growing tumors characterized by a well-circumscribed population of spindled cells with clear or amphophilic cytoplasm, though NF2-associated schwannomas may exhibit a variety of unusual features such as intraneural infiltration, which is prominent in this case.", "Zoom": 0.604, "Pan": [0.645, 0.467], "Overlay": {"x": 0.0, "y": 0.0, "width": 1.292, "height": 0.001}}, {"Name": "Antoni A Histology", "Group": "H&E", "Description": "Schwannomas typically exhibit varying proportion of two basic histologic patterns. Antoni A regions are more cellular regions consisting of densely packed spindle cells with plump elongate nuclei with tapering ends (a characteristic feature of nerve sheath tumors). Focal nuclear pallisading is a characteristic feature of schwannomas, and eosinophilic process-rich anuclear regions interposed with palisading nuclei may produce pathognomonic Verocay bodies. This tumor predominantly consisted of Antoni A areas, including in intraneural regions, though focal regions of Antoni B histology were observed.", "Zoom": 12.47, "Pan": [0.654, 0.554], "Overlay": {"x": 0.621, "y": 0.535, "width": 0.066, "height": 0.043}}, {"Name": "Antoni B Histology", "Group": "H&E", "Description": "Schwannomas typically exhibit varying proportion of two basic histologic patterns. Antoni B regions are less cellular and often exhibit smaller rounder nuclei with indistinct processes, a more collagenized or myxoid extracellular matrix, and variable lipidization. Verocay bodies are typically not present in Antoni B regions. There is often a sharp delineation between Antoni A and B regions within the tumor. Antoni B histology likely corresponds with more hyperintense regions on T2-weighted MRI sequences, due to the lower cellularity of these regions.", "Zoom": 11.6, "Pan": [0.646, 0.743], "Overlay": {"x": 0.609, "y": 0.721, "width": 0.072, "height": 0.048}}, {"Name": "Intraneural Infiltration", "Group": "H&E", "Description": "This tumor resection from an NF2 patient shows infiltration of tumor cells into a spinal nerve root. On the right side of the field is the normal caliber peripheral nerve, while the left side is expanded with whorls of neoplastic Schwann cells with subtle focal palisading interdigitating between individual nerve fibers (see also neurofilament and S100 immunohistochemistry). The biological basis for these differences in behavior compared to sporadic schwannomas is not well understood, as sporadic tumors also frequently exhibit loss of the NF2 gene.", "Zoom": 2.507, "Pan": [0.848, 0.333], "Overlay": {"x": 0.657, "y": 0.221, "width": 0.37, "height": 0.239}}, {"Name": "Whorled/Multinodular Architecture", "Group": "H&E", "Description": "NF2-associated schwannomas may exhibit unusual growth patterns, including a multinodular whorled architecture as is observed in the intraneural portion of this tumor. Such architecture likely reflects the polyclonal nature of NF2-associated masses (2).", "Zoom": 20.48, "Pan": [0.72, 0.298], "Overlay": {"x": 0.703, "y": 0.286, "width": 0.034, "height": 0.024}}, {"Name": "Degenerative Changes (Vacuolization/Microcystic Changes)", "Group": "H&E", "Description": "Schwannomas frequently exhibit a variety of degenerative changes including focal microcystic changes and vacuolization of tumor cells. These changes may be related to vascular abnormalities and hyalinization resulting in focal ischemia and/or hemorrhage.", "Zoom": 19.05, "Pan": [0.17, 0.857], "Overlay": {"x": 0.149, "y": 0.844, "width": 0.042, "height": 0.027}}]}]}