{"Name": "Intraneural Schwannoma (Spinal Nerve Root)", "Images": [{"Name": "i0", "Description": "Intraneural Schwannoma (Spinal Nerve Root) [Case #5] - Coy S, et al. Acta Neuropathologica. 2019", "Path": "https://s3.amazonaws.com/www.cycif.org/coy-acta-neuropathologica-2019", "Width": 67567, "Height": 59848, "MaxLevel": 7}], "Layout": {"Grid": [["i0"]]}, "Groups": [{"Path": "467160", "Name": "H&E", "Colors": ["8233CC", 905000], "Channels": ["Hematoxylin", "Neurofilament Protein"]}], "Stories": [{"Name": "Overview", "Description": null, "Waypoints": [{"Zoom": 0.605, "Pan": [0.592, 0.468], "Group": "H&E", "Name": "The Waypoint", "Description": "Neurofilament Protein (NFP) immunohistochemistry (IHC) stained section of an intraneural schwannoma involving the spinal nerve root of an NF2 patient. \n\n#### Figure from:\n\nCoy S et al. An update on the CNS manifestations of neurofibromatosis type 2. Acta Neuropathologica. 2019 Jun 4.\n[PubMed](https://www.ncbi.nlm.nih.gov/pubmed/31161239)\n", "Overlay": {"x": -100, "y": -100, "width": 200, "height": 200}}]}, {"Name": "About", "Description": null, "Waypoints": [{"Name": "Neurofilament Protein", "Group": "H&E", "Description": "Neurofilament protein (NFP) is an intermediate filament expressed predominantly in the axons of central and peripheral neurons. NFP immunohistochemistry may be used to highlight axonal fibers in a variety of settings, as in this region of peripheral nerve.", "Zoom": 11.6, "Pan": [0.805, 0.405], "Overlay": {"x": 0.777, "y": 0.383, "width": 0.058, "height": 0.049}}, {"Name": "Intraneural Schwannoma (Low Power)", "Group": "H&E", "Description": "Neurofilament Protein (NFP) immunohistochemistry highlights axonal filaments in a peripheral nerve segment involved by schwannoma in an NF2 patient. The right side of the field shows normal caliber peripheral nerve with well organized nerve fibers, while the left side of the field shows the nerve expanded by neoplastic schwannoma cells with infiltration between individual nerve fibers.", "Zoom": 2.507, "Pan": [0.723, 0.34], "Overlay": {"x": 0.547, "y": 0.232, "width": 0.329, "height": 0.229}}, {"Name": "Intraneural Schwannoma (High Power)", "Group": "H&E", "Description": "Neurofilament Protein (NFP) immunohistochemistry highlights axonal filaments in a peripheral nerve segment involved by schwannoma in an NF2 patient. A high power view of the intraneural portion of the schwannoma shows individual nerve fibers (highlighted by NFP IHC) splayed apart by interdigitating whorls of neoplastic cells. Some nerve fibers show enlargement or disruption, consistent with axonal injury. Damage to peripheral nerve fibers by schwannomas or microscopic proliferations of neoplastic Schwann cells - Schwann cell tumorlets or schwannosis - may correlate with the peripheral neuropathies seen in NF2 patients.", "Zoom": 14.44, "Pan": [0.647, 0.336], "Overlay": {"x": 0.617, "y": 0.321, "width": 0.058, "height": 0.035}}]}]}